  [
  {
    "id": 1,
    "question": "Đối tượng nghiên cứu của Chủ nghĩa xã hội khoa học là gì?",
    "references": null,
    "result": "Đối tượng nghiên cứu của Chủ nghĩa xã hội khoa học là **các quy luật và tính quy luật chính trị - xã hội của quá trình phát sinh, hình thành và phát triển của hình thái kinh tế - xã hội cộng sản chủ nghĩa**.\n\nNói cách khác, môn học này nghiên cứu những nguyên tắc, điều kiện, con đường, hình thức và phương pháp đấu tranh của giai cấp công nhân để thực hiện thắng lợi sứ mệnh lịch sử của mình.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 1: Nhập môn Chủ nghĩa xã hội khoa học.*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (NXB Chính trị quốc gia Sự thật)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 2,
    "question": "Sứ mệnh lịch sử của giai cấp công nhân được quy định bởi những điều kiện khách quan nào?",
    "references": null,
    "result": "Sứ mệnh lịch sử của giai cấp công nhân được quy định bởi hai điều kiện khách quan cơ bản sau:\n\n1. **Do địa vị kinh tế - xã hội:** Giai cấp công nhân là lực lượng đại diện cho lực lượng sản xuất tiên tiến, là sản phẩm của nền đại công nghiệp.\n2. **Do đặc điểm chính trị - xã hội:** Giai cấp công nhân có tính tổ chức, kỷ luật cao; có bản chất quốc tế; là giai cấp cách mạng và triệt để nhất.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 3: Sứ mệnh lịch sử của giai cấp công nhân.*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (Chương 3)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 3,
    "question": "Thời kỳ quá độ lên chủ nghĩa xã hội có những đặc điểm cơ bản nào?",
    "references": null,
    "result": "Thời kỳ quá độ lên chủ nghĩa xã hội là thời kỳ cải biến cách mạng sâu sắc, toàn diện trên mọi lĩnh vực, với những đặc điểm cơ bản:\n\n* **Về chính trị:** Là thời kỳ tồn tại nhà nước chuyên chính vô sản (nay gọi là nhà nước xã hội chủ nghĩa), thực hiện dân chủ và trấn áp các lực lượng chống đối.\n* **Về kinh tế:** Tồn tại nền kinh tế **nhiều thành phần**, trong đó thành phần kinh tế nhà nước giữ vai trò chủ đạo.\n* **Về tư tưởng - văn hóa:** Tồn tại song song và đấu tranh giữa tư tưởng xã hội chủ nghĩa và tư tưởng tư sản, lạc hậu.\n* **Về xã hội:** Tồn tại **nhiều giai cấp, tầng lớp** khác nhau (công nhân, nông dân, trí thức...) vừa hợp tác, vừa đấu tranh.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 4: Chủ nghĩa xã hội và thời kỳ quá độ lên chủ nghĩa xã hội.*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (Chương 4)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 4,
    "question": "Nền dân chủ xã hội chủ nghĩa có bản chất là gì?",
    "references": null,
    "result": "Bản chất của nền dân chủ xã hội chủ nghĩa là:\n\n* **Về chính trị:** Mang bản chất của **giai cấp công nhân**, đặt dưới sự lãnh đạo của Đảng Cộng sản. Đây là nền dân chủ **rộng rãi nhất** trong lịch sử (dân chủ cho đại đa số nhân dân lao động) nhưng cũng là nền dân chủ **triệt để nhất** (thực hiện chuyên chính với thiểu số bóc lột, chống đối).\n* **Về kinh tế:** Dựa trên chế độ **công hữu** về tư liệu sản xuất chủ yếu.\n* **Về tư tưởng - văn hóa:** Lấy hệ tư tưởng Mác-Lênin làm chủ đạo.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 5: Dân chủ xã hội chủ nghĩa và Nhà nước xã hội chủ nghĩa.*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (Chương 5)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 5,
    "question": "Tại sao liên minh giữa giai cấp công nhân, giai cấp nông dân và tầng lớp trí thức lại là tất yếu?",
    "references": null,
    "result": "Tính tất yếu của liên minh này xuất phát từ 3 lý do chính:\n\n* **Yêu cầu về chính trị:** Đây là **cơ sở chính trị - xã hội** vững chắc nhất để xây dựng nhà nước xã hội chủ nghĩa và bảo vệ chế độ.\n* **Yêu cầu về kinh tế:** Cả ba giai cấp, tầng lớp này đều gắn bó với các lĩnh vực then chốt của nền kinh tế (công nghiệp, nông nghiệp, khoa học - công nghệ). Chỉ liên minh với nhau mới có thể **phát triển lực lượng sản xuất** và xây dựng cơ sở vật chất cho chủ nghĩa xã hội.\n* **Yêu cầu về văn hóa - xã hội:** Liên minh là điều kiện để xây dựng nền văn hóa mới và con người mới XHCN.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 6: Cơ cấu xã hội - giai cấp và liên minh...*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (Chương 6)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 6,
    "question": "Chế độ hôn nhân tiến bộ trong chủ nghĩa xã hội được xây dựng dựa trên những nguyên tắc nào?",
    "references": null,
    "result": "Chế độ hôn nhân tiến bộ trong chủ nghĩa xã hội được xây dựng dựa trên 3 nguyên tắc cơ bản:\n\n1. **Hôn nhân tự nguyện** (dựa trên tình yêu chân chính).\n2. **Hôn nhân một vợ, một chồng**.\n3. **Vợ chồng bình đẳng** (bình đẳng về quyền lợi và nghĩa vụ).\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 8: Vấn đề gia đình trong thời kỳ quá độ...*\n\n*Các nguyên tắc này là cơ sở pháp lý để bảo đảm sự bình đẳng, tự do trong tình yêu và hôn nhân, xóa bỏ tàn dư của chế độ hôn nhân phong kiến và tư sản.*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (Chương 8)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 7,
    "question": "Nội dung chính sách dân tộc của Đảng và Nhà nước ta dựa trên những nguyên tắc nào?",
    "references": null,
    "result": "Chính sách dân tộc của Đảng và Nhà nước ta dựa trên 3 nguyên tắc cơ bản của Chủ nghĩa Mác-Lênin:\n\n1. **Bình đẳng:** Các dân tộc đều có quyền lợi và nghĩa vụ ngang nhau, không phân biệt đa số hay thiểu số, trình độ phát triển.\n2. **Đoàn kết:** Đoàn kết các dân tộc trong một quốc gia và đoàn kết dân tộc với quốc tế. Đây là cơ sở để thực hiện bình đẳng và giúp đỡ lẫn nhau.\n3. **Tôn trọng và giúp đỡ nhau cùng phát triển:** Tạo điều kiện cho các dân tộc, đặc biệt là vùng sâu, vùng xa, phát triển kinh tế - xã hội, nâng cao đời sống.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 7: Vấn đề dân tộc trong thời kỳ quá độ...*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (Chương 7)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 8,
    "question": "Những nguyên tắc cơ bản trong giải quyết vấn đề tôn giáo ở thời kỳ quá độ là gì?",
    "references": null,
    "result": "Giải quyết vấn đề tôn giáo trong thời kỳ quá độ cần tuân thủ 5 nguyên tắc cơ bản:\n\n1. **Tôn trọng, bảo đảm quyền tự do tín ngưỡng, tôn giáo** và **quyền tự do không tín ngưỡng, tôn giáo** của nhân dân.\n2. **Khắc phục dần** những ảnh hưởng tiêu cực của tôn giáo phải gắn liền với quá trình cải tạo xã hội cũ, xây dựng xã hội mới.\n3. **Phân biệt rõ hai mặt chính trị và tư tưởng** trong giải quyết vấn đề tôn giáo.\n4. **Quan điểm lịch sử - cụ thể:** Đánh giá và ứng xử với mỗi tôn giáo phải dựa trên hoàn cảnh lịch sử và vai trò của tôn giáo đó.\n5. **Tôn trọng quan điểm, lợi ích của đồng bào có đạo**, đoàn kết đồng bào theo đạo và không theo đạo.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 7: Vấn đề tôn giáo trong thời kỳ quá độ...*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (Chương 7)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  },
  {
    "id": 9,
    "question": "Những đặc trưng cơ bản của chủ nghĩa xã hội ở Việt Nam là gì?",
    "references": null,
    "result": "Theo Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên CNXH (bổ sung, phát triển 2011), xã hội XHCN mà nhân dân ta xây dựng có 8 đặc trưng cơ bản:\n\n1. Dân giàu, nước mạnh, dân chủ, công bằng, văn minh;\n2. Do nhân dân làm chủ;\n3. Có nền kinh tế phát triển cao dựa trên lực lượng sản xuất hiện đại và quan hệ sản xuất tiến bộ, phù hợp;\n4. Có nền văn hóa tiên tiến, đậm đà bản sắc dân tộc;\n5. Con người có cuộc sống ấm no, tự do, hạnh phúc, có điều kiện phát triển toàn diện;\n6. Các dân tộc trong cộng đồng Việt Nam bình đẳng, đoàn kết, tôn trọng và giúp nhau cùng phát triển;\n7. Có Nhà nước pháp quyền XHCN của nhân dân, do nhân dân, vì nhân dân do Đảng Cộng sản lãnh đạo;\n8. Có quan hệ hữu nghị và hợp tác với các nước trên thế giới.\n\n*Nguồn tham khảo:*\n\n*Văn kiện Đại hội Đảng XI (2011)*",
    "source_documents": [
      {
        "title": "Cương lĩnh xây dựng đất nước (bổ sung, phát triển 2011)",
        "link": "https://tulieuvankien.dangcongsan.vn/van-kien-dang-toan-tap/van-kien-dai-hoi-dang/dai-hoi-dang-lan-thu-xi/cuong-linh-xay-dung-dat-nuoc-trong-thoi-ky-qua-do-len-chu-nghia-xa-hoi-bo-sung-phat-trien-nam-2011-1616"
      }
    ]
  },
  {
    "id": 10,
    "question": "Thế nào là nền văn hóa xã hội chủ nghĩa?",
    "references": null,
    "result": "Nền văn hóa xã hội chủ nghĩa là nền văn hóa có những đặc trưng cơ bản sau:\n\n* **Nền tảng tư tưởng:** Dựa trên hệ tư tưởng Mác-Lênin, là nền văn hóa tiên tiến.\n* **Tính nhân dân rộng rãi:** Phục vụ lợi ích và nhu cầu tinh thần của đại đa số nhân dân lao động.\n* **Tính dân tộc:** Kế thừa và phát huy những giá trị văn hóa tốt đẹp của dân tộc, đồng thời mang bản sắc riêng của mỗi dân tộc.\n* **Tính quốc tế:** Tiếp thu tinh hoa văn hóa nhân loại, góp phần vào sự phát triển văn hóa thế giới.\n* **Phát triển toàn diện:** Hướng tới xây dựng con người phát triển toàn diện về đức, trí, thể, mỹ.\n\n*Nguồn tham khảo:*\n\n*Giáo trình Chủ nghĩa xã hội khoa học (Hội đồng Trung ương biên soạn, NXB Chính trị quốc gia Sự thật)*\n\n*Chương 6: Vấn đề văn hóa... (Thường được lồng ghép hoặc trong các chương về Xây dựng CNXH)*",
    "source_documents": [
      {
        "title": "Giáo trình Chủ nghĩa xã hội khoa học (NXB Chính trị quốc gia Sự thật)",
        "link": "https://www.nxbctqg.org.vn/giao-trinh-chu-nghia-xa-hoi-khoa-hoc.html"
      }
    ]
  }
]